# pandas帮助手册

## 参考文献

* https://pandas.pydata.org/pandas-docs/stable/user_guide/index.html#user-guide
* https://www.dataquest.io/blog/pandas-cheat-sheet/
* https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf
* https://geektutu.com/post/pandas-cheat-sheet-zh-cn/Pandas_Cheat_Sheet_zh_CN.pdf

## 导入包

In [1]:
import numpy as np
import pandas as pd
from sklearn import datasets
import requests

## 配置

### 配置pandas完全显示

In [2]:
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
pd.set_option('display.expand_frame_repr', False)
pd.set_option('display.max_colwidth', 100)

## 加载波士顿房价数据

加载波士顿房价数据

In [3]:
boston_ds = datasets.load_boston()

boston_df = pd.DataFrame(data=boston_ds.data, columns=boston_ds.feature_names)

In [4]:
boston_df.head(1).T

                 0
CRIM       0.00632
ZN        18.00000
INDUS      2.31000
CHAS       0.00000
NOX        0.53800
RM         6.57500
AGE       65.20000
DIS        4.09000
RAD        1.00000
TAX      296.00000
PTRATIO   15.30000
B        396.90000
LSTAT      4.98000

In [6]:
apple_stock_data_url = 'https://github.com/scikit-learn/examples-data/blob/master/financial-data/AAPL.csv'

## DataFrame

https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html

In [11]:
pd.to_datetime(['2020-10-25 02:00 +0200', '2020-10-25 04:00 +0100'])

Index([2020-10-25 02:00:00+02:00, 2020-10-25 04:00:00+01:00], dtype='object')

### 重置索引

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.reset_index.html

In [12]:
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                  index=['falcon', 'parrot', 'lion', 'monkey'],
                  columns=('class', 'max_speed'))

In [13]:
df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [14]:
df.reset_index()

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [16]:
df.reset_index(drop=True)

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN